RavenPai/EV/MIIT_Rover_ESP32_Firmware_v0.2.0/robot-esp32/MIIT_Rover_ESP32/MIIT_Rover_ESP32.ino
#include <Arduino.h>
#include <ArduinoJson.h>
#include <ctype.h>
#include <esp_arduino_version.h>
#include <esp_err.h>
#include <esp_idf_version.h>
#include <esp_task_wdt.h>

#include "config.h"

#if MIIT_ENABLE_BLUETOOTH_MANUAL
#if !defined(CONFIG_BT_ENABLED) || !defined(CONFIG_BLUEDROID_ENABLED)
#error "Classic Bluetooth is not enabled for this board. Set MIIT_ENABLE_BLUETOOTH_MANUAL to 0."
#endif
#if !defined(CONFIG_BT_SPP_ENABLED)
#error "Bluetooth SPP is only available on the classic ESP32. Set MIIT_ENABLE_BLUETOOTH_MANUAL to 0."
#endif
#include <BluetoothSerial.h>
BluetoothSerial SerialBT;
#endif

namespace {

enum class ControlMode : uint8_t { AUTO_MODE, MANUAL_MODE };

enum Fault : uint32_t {
  FAULT_NONE = 0,
  FAULT_ESTOP_INPUT = 1UL << 0,
  FAULT_PI_HARD_STOP = 1UL << 1,
  FAULT_REMOTE_ESTOP = 1UL << 2,
  FAULT_OUTPUTS_DISABLED = 1UL << 3,
  FAULT_PWM_INIT = 1UL << 4,
  FAULT_TASK_WATCHDOG = 1UL << 5,
  FAULT_PI_TIMEOUT = 1UL << 6,
  FAULT_COMMAND_EXPIRED = 1UL << 7,
  FAULT_PARSE = 1UL << 8,
  FAULT_PROTOCOL = 1UL << 9,
  FAULT_CRC = 1UL << 10,
  FAULT_SEQUENCE = 1UL << 11,
  FAULT_MODE_CHANGE = 1UL << 12,
  FAULT_MANUAL_TIMEOUT = 1UL << 13,
};

constexpr uint32_t NON_RESETTABLE_FAULTS =
    FAULT_OUTPUTS_DISABLED | FAULT_PWM_INIT | FAULT_TASK_WATCHDOG;
constexpr uint32_t ESTOP_FAULTS =
    FAULT_ESTOP_INPUT | FAULT_PI_HARD_STOP | FAULT_REMOTE_ESTOP;

struct MotorOutput {
  uint8_t pwmPin;
  uint8_t in1Pin;
  uint8_t in2Pin;
  uint8_t channel;
  bool inverted;
  int8_t lastDirection;
};

MotorOutput left1Motor = {cfg::LEFT1_PWM, cfg::LEFT1_IN1, cfg::LEFT1_IN2,
                          cfg::LEFT1_CHANNEL, cfg::LEFT1_INVERT, 0};
MotorOutput left2Motor = {cfg::LEFT2_PWM, cfg::LEFT2_IN1, cfg::LEFT2_IN2,
                          cfg::LEFT2_CHANNEL, cfg::LEFT2_INVERT, 0};
MotorOutput right1Motor = {cfg::RIGHT1_PWM, cfg::RIGHT1_IN1, cfg::RIGHT1_IN2,
                           cfg::RIGHT1_CHANNEL, cfg::RIGHT1_INVERT, 0};
MotorOutput right2Motor = {cfg::RIGHT2_PWM, cfg::RIGHT2_IN1, cfg::RIGHT2_IN2,
                           cfg::RIGHT2_CHANNEL, cfg::RIGHT2_INVERT, 0};

enum WheelIndex : uint8_t {
  LEFT_1 = 0,
  LEFT_2 = 1,
  RIGHT_1 = 2,
  RIGHT_2 = 3,
  WHEEL_COUNT = 4,
};

// This order intentionally matches the user's proven sketch: Left1, Left2,
// Right1, Right2.
MotorOutput *const motors[WHEEL_COUNT] = {&left1Motor, &left2Motor,
                                          &right1Motor, &right2Motor};

bool pwmReady = false;
bool taskWatchdogReady = false;
bool armed = false;
bool estopLatched = false;
uint32_t activeFaults = FAULT_NONE;
uint32_t faultHistory = FAULT_NONE;

ControlMode currentMode = ControlMode::MANUAL_MODE;
int16_t wheelTarget[WHEEL_COUNT] = {0, 0, 0, 0};
int16_t wheelApplied[WHEEL_COUNT] = {0, 0, 0, 0};
uint8_t manualPwmDuty = cfg::DEFAULT_MANUAL_PWM_DUTY;
bool bluetoothPreviouslyConnected = false;

uint32_t lastPiFrameMs = 0;
uint32_t motionDeadlineMs = 0;
bool motionDeadlineValid = false;
uint32_t lastManualCommandMs = 0;
uint32_t lastControlMs = 0;
uint32_t lastStatusMs = 0;

char activeSession[cfg::SESSION_MAX + 1] = {0};
bool sessionActive = false;
uint32_t lastSequence = 0;
bool sequenceActive = false;

char serialLine[cfg::SERIAL_LINE_MAX + 1] = {0};
size_t serialLineLength = 0;
bool discardSerialLine = false;

uint32_t resetPressStartedMs = 0;
bool resetHoldHandled = false;
bool resetReleasedSinceLatch = false;

const char *modeName(ControlMode mode) {
  return mode == ControlMode::AUTO_MODE ? "AUTO" : "MANUAL";
}

bool deadlineReached(uint32_t now, uint32_t deadline) {
  return static_cast<int32_t>(now - deadline) >= 0;
}

void setFault(uint32_t fault) {
  activeFaults |= fault;
  faultHistory |= fault;
}

void requireFreshLocalResetGesture() {
  resetPressStartedMs = 0;
  resetHoldHandled = false;
  resetReleasedSinceLatch = false;
}

bool estopLoopHealthy() {
#if MIIT_REQUIRE_ESTOP_LOOP
  return digitalRead(cfg::ESTOP_LOOP_PIN) == cfg::ESTOP_HEALTHY_LEVEL;
#else
  return true;
#endif
}

bool piHardStopActive() {
#if MIIT_USE_PI_HARD_STOP_INPUT
  return digitalRead(cfg::PI_HARD_STOP_PIN) == cfg::PI_HARD_STOP_ACTIVE_LEVEL;
#else
  return false;
#endif
}

ControlMode readControlMode() {
#if MIIT_USE_PHYSICAL_MODE_SWITCH
  return digitalRead(cfg::MODE_SELECT_PIN) == cfg::MANUAL_MODE_LEVEL
             ? ControlMode::MANUAL_MODE
             : ControlMode::AUTO_MODE;
#else
  return currentMode;
#endif
}

void writePwm(const MotorOutput &motor, uint16_t duty) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(motor.pwmPin, duty);
#else
  ledcWrite(motor.channel, duty);
#endif
}

bool attachPwm(const MotorOutput &motor) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  return ledcAttach(motor.pwmPin, cfg::PWM_FREQUENCY_HZ,
                    cfg::PWM_RESOLUTION_BITS);
#else
  const double actualFrequency =
      ledcSetup(motor.channel, cfg::PWM_FREQUENCY_HZ,
                cfg::PWM_RESOLUTION_BITS);
  ledcAttachPin(motor.pwmPin, motor.channel);
  return actualFrequency > 0.0;
#endif
}

void setMotorPinsLow(MotorOutput &motor) {
  writePwm(motor, 0);
  digitalWrite(motor.in1Pin, LOW);
  digitalWrite(motor.in2Pin, LOW);
  motor.lastDirection = 0;
}

void hardDisableMotors() {
  for (uint8_t index = 0; index < WHEEL_COUNT; ++index) {
    setMotorPinsLow(*motors[index]);
    wheelTarget[index] = 0;
    wheelApplied[index] = 0;
  }
  motionDeadlineValid = false;
}

void writeMotor(MotorOutput &motor, int16_t permille) {
#if !MIIT_ENABLE_MOTOR_OUTPUTS
  (void)permille;
  setMotorPinsLow(motor);
  return;
#else
  int16_t command = motor.inverted ? -permille : permille;
  command = constrain(command, -1000, 1000);

  if (command == 0) {
    setMotorPinsLow(motor);
    return;
  }

  const int8_t direction = command > 0 ? 1 : -1;
  if (motor.lastDirection != 0 && motor.lastDirection != direction) {
    // Remove drive before changing bridge direction. The slew limiter normally
    // crosses zero first; this is a second defensive layer.
    setMotorPinsLow(motor);
    return;
  }

