RavenPai/EV/MIIT_Rover_ESP32_Firmware_v0.2.0/robot-esp32/MIIT_Rover_ESP32/MIIT_Rover_ESP32.ino
  writePwm(motor, 0);
  if (direction > 0) {
    digitalWrite(motor.in1Pin, HIGH);
    digitalWrite(motor.in2Pin, LOW);
  } else {
    digitalWrite(motor.in1Pin, LOW);
    digitalWrite(motor.in2Pin, HIGH);
  }

  const uint32_t magnitude = static_cast<uint32_t>(abs(command));
  const uint16_t duty = static_cast<uint16_t>(
      (magnitude * static_cast<uint32_t>(cfg::PWM_MAX_DUTY)) / 1000UL);
  writePwm(motor, duty);
  motor.lastDirection = direction;
#endif
}

void setWheelTargets(int16_t left1, int16_t left2, int16_t right1,
                     int16_t right2) {
  wheelTarget[LEFT_1] = left1;
  wheelTarget[LEFT_2] = left2;
  wheelTarget[RIGHT_1] = right1;
  wheelTarget[RIGHT_2] = right2;
}

void applyWheelOutputs() {
  for (uint8_t index = 0; index < WHEEL_COUNT; ++index) {
    writeMotor(*motors[index], wheelApplied[index]);
  }
}

void mixMecanumTargets(int32_t vx, int32_t vy, int32_t wz,
                       int16_t limitPermille) {
  // ROS REP-103 signs: +vx forward, +vy left, +wz counter-clockwise/left.
  // The four signs reproduce the user's proven F/L/R/G/I motor patterns.
  int32_t mixed[WHEEL_COUNT] = {
      vx + vy - wz,  // Left 1
      vx - vy - wz,  // Left 2
      vx - vy + wz,  // Right 1
      vx + vy + wz,  // Right 2
  };

  int32_t largestMagnitude = 0;
  for (uint8_t index = 0; index < WHEEL_COUNT; ++index) {
    const int32_t magnitude = labs(mixed[index]);
    if (magnitude > largestMagnitude) {
      largestMagnitude = magnitude;
    }
  }

  if (largestMagnitude > limitPermille && largestMagnitude > 0) {
    for (uint8_t index = 0; index < WHEEL_COUNT; ++index) {
      mixed[index] = (mixed[index] * limitPermille) / largestMagnitude;
    }
  }

  setWheelTargets(static_cast<int16_t>(mixed[LEFT_1]),
                  static_cast<int16_t>(mixed[LEFT_2]),
                  static_cast<int16_t>(mixed[RIGHT_1]),
                  static_cast<int16_t>(mixed[RIGHT_2]));
}

void safeStop(uint32_t fault = FAULT_NONE) {
  if (fault != FAULT_NONE) {
    setFault(fault);
  }
  armed = false;
  hardDisableMotors();
}

bool hardwareReadyToArm() {
  if (!pwmReady || !taskWatchdogReady) {
    return false;
  }
#if !MIIT_ENABLE_MOTOR_OUTPUTS
  return false;
#endif
  if (!estopLoopHealthy() || piHardStopActive() || estopLatched) {
    return false;
  }
  return (activeFaults & NON_RESETTABLE_FAULTS) == 0;
}

void sendJson(JsonDocument &doc, Stream &stream) {
  serializeJson(doc, stream);
  stream.write('\n');
}

void addCommonState(JsonDocument &doc) {
  doc["mode"] = modeName(currentMode);
  doc["armed"] = armed;
  doc["estopLatched"] = estopLatched;
  doc["estopInputHealthy"] = estopLoopHealthy();
  doc["piHardStop"] = piHardStopActive();
  doc["motorOutputsEnabled"] = MIIT_ENABLE_MOTOR_OUTPUTS != 0;
  doc["activeFaults"] = activeFaults;
  doc["faultHistory"] = faultHistory;
  doc["left1Target"] = wheelTarget[LEFT_1];
  doc["left2Target"] = wheelTarget[LEFT_2];
  doc["right1Target"] = wheelTarget[RIGHT_1];
  doc["right2Target"] = wheelTarget[RIGHT_2];
  doc["left1Applied"] = wheelApplied[LEFT_1];
  doc["left2Applied"] = wheelApplied[LEFT_2];
  doc["right1Applied"] = wheelApplied[RIGHT_1];
  doc["right2Applied"] = wheelApplied[RIGHT_2];
  doc["manualPwmDuty"] = manualPwmDuty;
}

void sendState(const char *type = "STATE") {
  JsonDocument doc;
  doc["v"] = 1;
  doc["type"] = type;
  doc["firmware"] = cfg::FIRMWARE_VERSION;
  doc["uptimeMs"] = millis();
  addCommonState(doc);
  sendJson(doc, Serial);
}

void sendAck(const char *command, bool ok, const char *reason,
             bool hasSequence = false, uint32_t sequence = 0) {
  JsonDocument doc;
  doc["v"] = 1;
  doc["type"] = ok ? "ACK" : "NACK";
  doc["cmd"] = command;
  if (hasSequence) {
    doc["seq"] = sequence;
  }
  doc["ok"] = ok;
  if (reason != nullptr && reason[0] != '\0') {
    doc["reason"] = reason;
  }
  addCommonState(doc);
  sendJson(doc, Serial);
}

#if MIIT_ENABLE_BLUETOOTH_MANUAL
void sendBluetoothReply(const char *message) {
  SerialBT.println(message);
}
#endif

uint16_t crc16CcittFalse(const uint8_t *data, size_t length) {
  uint16_t crc = 0xFFFF;
  for (size_t i = 0; i < length; ++i) {
    crc ^= static_cast<uint16_t>(data[i]) << 8;
    for (uint8_t bit = 0; bit < 8; ++bit) {
      crc = (crc & 0x8000U) ? static_cast<uint16_t>((crc << 1U) ^ 0x1021U)
                            : static_cast<uint16_t>(crc << 1U);
    }
  }
  return crc;
}

bool validSessionName(const char *session) {
  if (session == nullptr) {
    return false;
  }
  const size_t length = strlen(session);
  if (length == 0 || length > cfg::SESSION_MAX) {
    return false;
  }
  for (size_t i = 0; i < length; ++i) {
    const char c = session[i];
    if (!(isalnum(static_cast<unsigned char>(c)) || c == '-' || c == '_' ||
          c == '.' || c == ':')) {
      return false;
    }
  }
  return true;
}

bool parseCrc16(JsonVariantConst value, uint16_t &result) {
  if (!value.is<const char *>()) {
    return false;
  }
  const char *text = value.as<const char *>();
  if (text == nullptr || strlen(text) != 4) {
    return false;
  }
  for (size_t i = 0; i < 4; ++i) {
    if (!isxdigit(static_cast<unsigned char>(text[i]))) {
      return false;
    }
  }
  char *end = nullptr;
  const unsigned long parsed = strtoul(text, &end, 16);
  if (end == nullptr || *end != '\0' || parsed > 0xFFFFUL) {
    return false;
  }
  result = static_cast<uint16_t>(parsed);
  return true;
}

bool computeFrameCrc(uint32_t version, const char *session, uint32_t sequence,
                     const char *command, int32_t vx, int32_t vy, int32_t wz,
                     uint32_t ttlMs, uint16_t &result) {
  char canonical[160];
  const int written = snprintf(
      canonical, sizeof(canonical), "%lu|%s|%lu|%s|%ld|%ld|%ld|%lu",
      static_cast<unsigned long>(version), session,
      static_cast<unsigned long>(sequence), command, static_cast<long>(vx),
      static_cast<long>(vy), static_cast<long>(wz),
      static_cast<unsigned long>(ttlMs));
  if (written <= 0 || static_cast<size_t>(written) >= sizeof(canonical)) {
    return false;
  }
  result = crc16CcittFalse(reinterpret_cast<const uint8_t *>(canonical),
                           static_cast<size_t>(written));
  return true;
}

bool sequenceIsNewer(uint32_t candidate, uint32_t previous) {
  return static_cast<int32_t>(candidate - previous) > 0;
}

