RavenPai/EV/MIIT_Rover_ESP32_Firmware_v0.2.0/robot-esp32/MIIT_Rover_ESP32/MIIT_Rover_ESP32.ino
void rejectProtectedFrame(const char *command, const char *reason,
                          uint32_t fault, bool hasSequence,
                          uint32_t sequence) {
  safeStop(fault);
  sendAck(command, false, reason, hasSequence, sequence);
}

void clearTransientFaultsForArm() {
  activeFaults &= (NON_RESETTABLE_FAULTS | ESTOP_FAULTS);
}

void handleProtectedCommand(JsonDocument &doc, const char *command) {
  const bool hasSequence = doc["seq"].is<uint32_t>();
  const uint32_t sequence = hasSequence ? doc["seq"].as<uint32_t>() : 0;

  if (!doc["session"].is<const char *>() || !hasSequence ||
      !doc["ttlMs"].is<uint32_t>() || !doc["crc16"].is<const char *>()) {
    rejectProtectedFrame(command, "MISSING_OR_INVALID_FIELDS", FAULT_PROTOCOL,
                         hasSequence, sequence);
    return;
  }

  const char *session = doc["session"].as<const char *>();
  const uint32_t ttlMs = doc["ttlMs"].as<uint32_t>();
  if (!validSessionName(session) || ttlMs < cfg::MIN_COMMAND_TTL_MS ||
      ttlMs > cfg::MAX_COMMAND_TTL_MS) {
    rejectProtectedFrame(command, "BAD_SESSION_OR_TTL", FAULT_PROTOCOL, true,
                         sequence);
    return;
  }

  int32_t vx = 0;
  int32_t vy = 0;
  int32_t wz = 0;
  if (!doc["vx"].isNull()) {
    if (!doc["vx"].is<int32_t>()) {
      rejectProtectedFrame(command, "BAD_VX_VALUE", FAULT_PROTOCOL, true,
                           sequence);
      return;
    }
    vx = doc["vx"].as<int32_t>();
  }
  if (!doc["vy"].isNull()) {
    if (!doc["vy"].is<int32_t>()) {
      rejectProtectedFrame(command, "BAD_VY_VALUE", FAULT_PROTOCOL, true,
                           sequence);
      return;
    }
    vy = doc["vy"].as<int32_t>();
  }
  if (!doc["wz"].isNull()) {
    if (!doc["wz"].is<int32_t>()) {
      rejectProtectedFrame(command, "BAD_WZ_VALUE", FAULT_PROTOCOL, true,
                           sequence);
      return;
    }
    wz = doc["wz"].as<int32_t>();
  }

  uint16_t receivedCrc = 0;
  uint16_t calculatedCrc = 0;
  if (!parseCrc16(doc["crc16"], receivedCrc) ||
      !computeFrameCrc(1, session, sequence, command, vx, vy, wz, ttlMs,
                       calculatedCrc) ||
      receivedCrc != calculatedCrc) {
    rejectProtectedFrame(command, "CRC_MISMATCH", FAULT_CRC, true, sequence);
    return;
  }

  const bool isArm = strcmp(command, "ARM") == 0;
  if (!isArm) {
    if (!sessionActive || strcmp(session, activeSession) != 0) {
      rejectProtectedFrame(command, "SESSION_MISMATCH", FAULT_SEQUENCE, true,
                           sequence);
      return;
    }
    if (!sequenceActive || !sequenceIsNewer(sequence, lastSequence)) {
      rejectProtectedFrame(command, "DUPLICATE_OR_OLD_SEQUENCE",
                           FAULT_SEQUENCE, true, sequence);
      return;
    }
  } else if (sessionActive && strcmp(session, activeSession) == 0 &&
             sequenceActive && !sequenceIsNewer(sequence, lastSequence)) {
    rejectProtectedFrame(command, "DUPLICATE_OR_OLD_SEQUENCE", FAULT_SEQUENCE,
                         true, sequence);
    return;
  }

  // The frame is authentic only in the frame-integrity sense. UART CRC is not
  // cryptographic authentication; physical access to the serial link is trusted.
  strlcpy(activeSession, session, sizeof(activeSession));
  sessionActive = true;
  lastSequence = sequence;
  sequenceActive = true;

  const uint32_t now = millis();

  if (isArm) {
    if (vx != 0 || vy != 0 || wz != 0) {
      rejectProtectedFrame(command, "ARM_MUST_HAVE_ZERO_TARGETS",
                           FAULT_PROTOCOL, true, sequence);
      return;
    }
    clearTransientFaultsForArm();
#if MIIT_USE_PHYSICAL_MODE_SWITCH
    if (currentMode != ControlMode::AUTO_MODE) {
      safeStop(FAULT_MODE_CHANGE);
      sendAck(command, false, "NOT_IN_AUTO_MODE", true, sequence);
      return;
    }
#else
    if (currentMode == ControlMode::MANUAL_MODE && armed) {
      safeStop(FAULT_MODE_CHANGE);
      sendAck(command, false, "MANUAL_WAS_ACTIVE_RETRY_ARM", true, sequence);
      return;
    }
    if (currentMode != ControlMode::AUTO_MODE) {
      safeStop();
      currentMode = ControlMode::AUTO_MODE;
      activeFaults &= ~FAULT_MODE_CHANGE;
    }
#endif
    if (!hardwareReadyToArm()) {
      safeStop();
      sendAck(command, false, "HARDWARE_NOT_SAFE", true, sequence);
      return;
    }
    hardDisableMotors();
    armed = true;
    lastPiFrameMs = now;
    sendAck(command, true, "ARMED_ZERO_OUTPUT", true, sequence);
    return;
  }

  if (strcmp(command, "HEARTBEAT") == 0) {
    if (vx != 0 || vy != 0 || wz != 0) {
      rejectProtectedFrame(command, "HEARTBEAT_MUST_HAVE_ZERO_TARGETS",
                           FAULT_PROTOCOL, true, sequence);
      return;
    }
    lastPiFrameMs = now;
    sendAck(command, true, armed ? "LINK_OK" : "LINK_OK_DISARMED", true,
            sequence);
    return;
  }

  if (strcmp(command, "DRIVE") == 0) {
    if (currentMode != ControlMode::AUTO_MODE || !armed ||
        !hardwareReadyToArm()) {
      safeStop();
      sendAck(command, false, "NOT_ARMED_OR_NOT_SAFE", true, sequence);
      return;
    }
    if (vx < -cfg::MAX_AUTO_PERMILLE || vx > cfg::MAX_AUTO_PERMILLE ||
        vy < -cfg::MAX_AUTO_PERMILLE || vy > cfg::MAX_AUTO_PERMILLE ||
        wz < -cfg::MAX_AUTO_PERMILLE || wz > cfg::MAX_AUTO_PERMILLE) {
      rejectProtectedFrame(command, "TARGET_EXCEEDS_LIMIT", FAULT_PROTOCOL,
                           true, sequence);
      return;
    }
    mixMecanumTargets(vx, vy, wz, cfg::MAX_AUTO_PERMILLE);
    lastPiFrameMs = now;
    motionDeadlineMs = now + ttlMs;
    motionDeadlineValid = true;
    sendAck(command, true, "TARGET_ACCEPTED", true, sequence);
    return;
  }

  rejectProtectedFrame(command, "UNKNOWN_PROTECTED_COMMAND", FAULT_PROTOCOL,
                       true, sequence);
}

void latchEmergencyStop(uint32_t fault, const char *reason) {
  estopLatched = true;
  requireFreshLocalResetGesture();
  safeStop(fault);
  sendAck("ESTOP", true, reason);
}

void handlePiLine(const char *line) {
  JsonDocument doc;
  const DeserializationError error = deserializeJson(doc, line);
  if (error) {
    safeStop(FAULT_PARSE);
    sendAck("INVALID", false, "MALFORMED_JSON");
    return;
  }

  if (!doc["v"].is<uint32_t>() || doc["v"].as<uint32_t>() != 1 ||
      !doc["cmd"].is<const char *>()) {
    safeStop(FAULT_PROTOCOL);
    sendAck("INVALID", false, "BAD_VERSION_OR_COMMAND");
    return;
  }

  const char *command = doc["cmd"].as<const char *>();
  if (command == nullptr || strlen(command) == 0 || strlen(command) > 24) {
    safeStop(FAULT_PROTOCOL);
    sendAck("INVALID", false, "BAD_COMMAND");
    return;
  }

