RavenPai/EV/MIIT_Rover_ESP32_Firmware_v0.2.0/robot-esp32/MIIT_Rover_ESP32/MIIT_Rover_ESP32.ino
  // STOP is deliberately fail-open for stopping: it does not need a CRC,
  // session, or sequence. It can never cause motion.
  if (strcmp(command, "STOP") == 0) {
    safeStop();
    const bool hasSequence = doc["seq"].is<uint32_t>();
    sendAck(command, true, "STOPPED", hasSequence,
            hasSequence ? doc["seq"].as<uint32_t>() : 0);
    return;
  }

  // ESTOP is also accepted without CRC because accepting an extra stop is safe.
  // It latches and needs the local reset button after all hard-stop inputs clear.
  if (strcmp(command, "ESTOP") == 0) {
    latchEmergencyStop(FAULT_REMOTE_ESTOP, "REMOTE_ESTOP_LATCHED");
    return;
  }

  if (strcmp(command, "STATUS") == 0 || strcmp(command, "PING") == 0) {
    sendAck(command, true, "STATUS_ONLY");
    return;
  }

  if (strcmp(command, "ARM") == 0 || strcmp(command, "HEARTBEAT") == 0 ||
      strcmp(command, "DRIVE") == 0) {
    handleProtectedCommand(doc, command);
    return;
  }

  safeStop(FAULT_PROTOCOL);
  sendAck(command, false, "UNKNOWN_COMMAND");
}

void servicePiSerial() {
  while (Serial.available() > 0) {
    const char c = static_cast<char>(Serial.read());
    if (c == '\r') {
      continue;
    }
    if (c == '\n') {
      if (!discardSerialLine && serialLineLength > 0) {
        serialLine[serialLineLength] = '\0';
        handlePiLine(serialLine);
      }
      serialLineLength = 0;
      discardSerialLine = false;
      continue;
    }

    if (discardSerialLine) {
      continue;
    }
    if (serialLineLength >= cfg::SERIAL_LINE_MAX) {
      discardSerialLine = true;
      serialLineLength = 0;
      safeStop(FAULT_PROTOCOL);
      sendAck("INVALID", false, "SERIAL_FRAME_TOO_LONG");
      continue;
    }
    serialLine[serialLineLength++] = c;
  }
}

void clearEmergencyLatchLocally() {
  if (!estopLatched) {
    sendAck("LOCAL_RESET", false, "NO_ESTOP_LATCH_TO_CLEAR");
    return;
  }
  if (!estopLoopHealthy() || piHardStopActive()) {
    sendAck("LOCAL_RESET", false, "HARD_STOP_INPUT_STILL_ACTIVE");
    return;
  }

  hardDisableMotors();
  armed = false;
  estopLatched = false;
  requireFreshLocalResetGesture();
  activeFaults &= NON_RESETTABLE_FAULTS;
  sessionActive = false;
  sequenceActive = false;
  activeSession[0] = '\0';
  sendAck("LOCAL_RESET", true, "LATCH_CLEARED_REMAINS_DISARMED");
}

void serviceLocalResetButton(uint32_t now) {
  const bool pressed =
      digitalRead(cfg::LOCAL_RESET_PIN) == cfg::LOCAL_RESET_ACTIVE_LEVEL;
  if (!pressed) {
    resetPressStartedMs = 0;
    resetHoldHandled = false;
    if (estopLatched) {
      resetReleasedSinceLatch = true;
    }
    return;
  }

  if (!estopLatched || !resetReleasedSinceLatch) {
    // A reset button held before a new ESTOP is not a valid reset gesture.
    // Require release after the latch, then a new press-and-hold.
    resetPressStartedMs = 0;
    resetHoldHandled = false;
    return;
  }

  if (resetPressStartedMs == 0) {
    resetPressStartedMs = now;
    return;
  }

  if (!resetHoldHandled &&
      static_cast<uint32_t>(now - resetPressStartedMs) >=
          cfg::LOCAL_RESET_HOLD_MS) {
    resetHoldHandled = true;
    clearEmergencyLatchLocally();
  }
}

void serviceSafetyInputs(uint32_t now) {
  if (!estopLoopHealthy()) {
    if (!estopLatched || (activeFaults & FAULT_ESTOP_INPUT) == 0) {
      estopLatched = true;
      requireFreshLocalResetGesture();
      safeStop(FAULT_ESTOP_INPUT);
      sendAck("ESTOP_INPUT", true, "PHYSICAL_ESTOP_OR_OPEN_LOOP");
    } else {
      hardDisableMotors();
      armed = false;
    }
  }

  if (piHardStopActive()) {
    if (!estopLatched || (activeFaults & FAULT_PI_HARD_STOP) == 0) {
      estopLatched = true;
      requireFreshLocalResetGesture();
      safeStop(FAULT_PI_HARD_STOP);
      sendAck("PI_HARD_STOP", true, "PI_HARD_STOP_LATCHED");
    } else {
      hardDisableMotors();
      armed = false;
    }
  }

  const ControlMode sampledMode = readControlMode();
  if (sampledMode != currentMode) {
    currentMode = sampledMode;
    safeStop(FAULT_MODE_CHANGE);
    sessionActive = false;
    sequenceActive = false;
    activeSession[0] = '\0';
    sendAck("MODE_CHANGE", true, "STOPPED_AND_DISARMED");
  }

  serviceLocalResetButton(now);
}

int16_t moveToward(int16_t current, int16_t target, uint32_t elapsedMs) {
  if (current == target) {
    return current;
  }
  int32_t step = (static_cast<int32_t>(cfg::SLEW_PERMILLE_PER_SECOND) *
                  static_cast<int32_t>(elapsedMs)) /
                 1000;
  if (step < 1) {
    step = 1;
  }
  if (target > current) {
    const int32_t candidate = static_cast<int32_t>(current) + step;
    return static_cast<int16_t>(candidate > target ? target : candidate);
  }
  const int32_t candidate = static_cast<int32_t>(current) - step;
  return static_cast<int16_t>(candidate < target ? target : candidate);
}

void serviceCommandWatchdogs(uint32_t now) {
  if (!armed) {
    return;
  }

  if (currentMode == ControlMode::AUTO_MODE) {
    if (static_cast<uint32_t>(now - lastPiFrameMs) >
        cfg::PI_LINK_TIMEOUT_MS) {
      safeStop(FAULT_PI_TIMEOUT);
      sendAck("WATCHDOG", false, "PI_HEARTBEAT_TIMEOUT");
      return;
    }
    if (motionDeadlineValid && deadlineReached(now, motionDeadlineMs)) {
      safeStop(FAULT_COMMAND_EXPIRED);
      sendAck("WATCHDOG", false, "DRIVE_TTL_EXPIRED");
      return;
    }
  }
#if !MIIT_BT_LEGACY_LATCHED_COMMANDS
  else if (static_cast<uint32_t>(now - lastManualCommandMs) >
           cfg::MANUAL_COMMAND_TIMEOUT_MS) {
    safeStop(FAULT_MANUAL_TIMEOUT);
    sendAck("WATCHDOG", false, "MANUAL_COMMAND_TIMEOUT");
#if MIIT_ENABLE_BLUETOOTH_MANUAL
    sendBluetoothReply("STOPPED: command timeout; send A to arm again");
#endif
  }
#endif
}

void serviceMotorControl(uint32_t now) {
  const uint32_t elapsed = now - lastControlMs;
  if (elapsed < cfg::CONTROL_PERIOD_MS) {
    return;
  }
  lastControlMs = now;

  if (!armed || !hardwareReadyToArm()) {
    hardDisableMotors();
    return;
  }

  for (uint8_t index = 0; index < WHEEL_COUNT; ++index) {
    wheelApplied[index] =
        moveToward(wheelApplied[index], wheelTarget[index], elapsed);
  }
  applyWheelOutputs();
}

#if MIIT_ENABLE_BLUETOOTH_MANUAL
int16_t manualSpeedPermille() {
  return static_cast<int16_t>(
      (static_cast<uint32_t>(manualPwmDuty) * 1000UL + 127UL) / 255UL);
}

