RavenPai/EV/MIIT_Rover_ESP32_Firmware_v0.2.0/robot-esp32/MIIT_Rover_ESP32/MIIT_Rover_ESP32.ino
bool armManual(uint32_t now) {
  clearTransientFaultsForArm();
#if MIIT_USE_PHYSICAL_MODE_SWITCH
  if (currentMode != ControlMode::MANUAL_MODE) {
    safeStop(FAULT_MODE_CHANGE);
    sendBluetoothReply("NACK: physical switch is not MANUAL");
    return false;
  }
#else
  if (currentMode == ControlMode::AUTO_MODE && armed) {
    sendBluetoothReply("NACK: send S first to stop AUTO mode");
    return false;
  }
  if (currentMode != ControlMode::MANUAL_MODE) {
    safeStop();
    currentMode = ControlMode::MANUAL_MODE;
    activeFaults &= ~FAULT_MODE_CHANGE;
  }
#endif
  if (!hardwareReadyToArm()) {
    safeStop();
    sendBluetoothReply("NACK: hardware not safe; check STATUS on USB serial");
    return false;
  }
  hardDisableMotors();
  armed = true;
  lastManualCommandMs = now;
  sendBluetoothReply("ACK: MANUAL ARMED at zero output");
  return true;
}

void handleManualCharacter(char command, uint32_t now) {
  command = static_cast<char>(toupper(static_cast<unsigned char>(command)));
  if (command == '\r' || command == '\n' || command == ' ') {
    return;
  }

  if (command == 'E') {
    estopLatched = true;
    requireFreshLocalResetGesture();
    safeStop(FAULT_REMOTE_ESTOP);
    sendBluetoothReply("ESTOP LATCHED: release hazards then hold local RESET");
    return;
  }
  if (command == 'S') {
    safeStop();
#if !MIIT_USE_PHYSICAL_MODE_SWITCH
    currentMode = ControlMode::MANUAL_MODE;
    activeFaults &= ~FAULT_MODE_CHANGE;
#endif
    sendBluetoothReply("STOPPED and disarmed");
    return;
  }
  if (command == 'A') {
    armManual(now);
    return;
  }

  if (command >= '0' && command <= '9') {
    const uint16_t digit = static_cast<uint16_t>(command - '0');
    manualPwmDuty = static_cast<uint8_t>(
        cfg::MIN_MANUAL_PWM_DUTY +
        (digit * (cfg::MAX_MANUAL_PWM_DUTY - cfg::MIN_MANUAL_PWM_DUTY)) / 9U);
    sendBluetoothReply("ACK: manual speed set");
    return;
  }
  if (command == 'Q') {
    manualPwmDuty = cfg::MAX_MANUAL_PWM_DUTY;
    sendBluetoothReply("ACK: manual speed set to 255");
    return;
  }

  const bool movementCommand = command == 'F' || command == 'B' ||
                               command == 'L' || command == 'R' ||
                               command == 'G' || command == 'I';
  if (!movementCommand) {
    safeStop(FAULT_PROTOCOL);
    sendBluetoothReply("NACK: unknown command; robot stopped");
    return;
  }

  if (!armed) {
#if MIIT_MANUAL_REQUIRE_ARM_COMMAND
    sendBluetoothReply("NACK: send A before movement");
    return;
#else
    if (!armManual(now)) {
      return;
    }
#endif
  }

  if (currentMode != ControlMode::MANUAL_MODE || !hardwareReadyToArm()) {
    safeStop();
    sendBluetoothReply("NACK: MANUAL mode is not safe");
    return;
  }

  const int16_t speed = manualSpeedPermille();
  switch (command) {
    case 'F':
      // forward(): L1+, L2+, R1+, R2+
      setWheelTargets(speed, speed, speed, speed);
      break;
    case 'B':
      // backward(): L1-, L2-, R1-, R2-
      setWheelTargets(-speed, -speed, -speed, -speed);
      break;
    case 'L':
      // moveLeft(): L1+, L2-, R1-, R2+
      setWheelTargets(speed, -speed, -speed, speed);
      break;
    case 'R':
      // moveRight(): L1-, L2+, R1+, R2-
      setWheelTargets(-speed, speed, speed, -speed);
      break;
    case 'G':
      // turnLeft(): L1-, L2-, R1+, R2+
      setWheelTargets(-speed, -speed, speed, speed);
      break;
    case 'I':
      // turnRight(): L1+, L2+, R1-, R2-
      setWheelTargets(speed, speed, -speed, -speed);
      break;
    default:
      return;
  }

  lastManualCommandMs = now;
#if !MIIT_BT_LEGACY_LATCHED_COMMANDS
  motionDeadlineMs = now + cfg::MANUAL_COMMAND_TIMEOUT_MS;
  motionDeadlineValid = true;
#endif
}

void serviceBluetoothManual(uint32_t now) {
  const bool connected = SerialBT.hasClient();
  if (bluetoothPreviouslyConnected && !connected &&
      currentMode == ControlMode::MANUAL_MODE && armed) {
    safeStop(FAULT_MANUAL_TIMEOUT);
    sendAck("BLUETOOTH", false, "BLUETOOTH_DISCONNECTED");
  }
  bluetoothPreviouslyConnected = connected;

  while (SerialBT.available() > 0) {
    handleManualCharacter(static_cast<char>(SerialBT.read()), now);
  }
}
#endif

bool configurePwmAndPins() {
  bool ok = true;
  for (MotorOutput *motor : motors) {
    pinMode(motor->in1Pin, OUTPUT);
    pinMode(motor->in2Pin, OUTPUT);
    digitalWrite(motor->in1Pin, LOW);
    digitalWrite(motor->in2Pin, LOW);
    ok = attachPwm(*motor) && ok;
    writePwm(*motor, 0);
  }
  return ok;
}

bool configureTaskWatchdog() {
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_err_t status = esp_task_wdt_status(nullptr);
  esp_task_wdt_config_t watchdogConfig = {};
  watchdogConfig.timeout_ms = cfg::TASK_WATCHDOG_TIMEOUT_MS;
  watchdogConfig.idle_core_mask = 0;
  watchdogConfig.trigger_panic = true;
  if (status == ESP_ERR_INVALID_STATE) {
    const esp_err_t initialized = esp_task_wdt_init(&watchdogConfig);
    if (initialized != ESP_OK) {
      return false;
    }
    status = esp_task_wdt_status(nullptr);
  } else if (esp_task_wdt_reconfigure(&watchdogConfig) != ESP_OK) {
    return false;
  }
  if (status != ESP_OK) {
    const esp_err_t added = esp_task_wdt_add(nullptr);
    if (added != ESP_OK) {
      return false;
    }
  }
  return esp_task_wdt_status(nullptr) == ESP_OK;
#else
  const uint32_t roundedSeconds =
      (cfg::TASK_WATCHDOG_TIMEOUT_MS + 999U) / 1000U;
  const uint32_t timeoutSeconds = roundedSeconds < 1U ? 1U : roundedSeconds;
  const esp_err_t initialized = esp_task_wdt_init(timeoutSeconds, true);
  if (initialized != ESP_OK && initialized != ESP_ERR_INVALID_STATE) {
    return false;
  }
  const esp_err_t added = esp_task_wdt_add(nullptr);
  return added == ESP_OK || added == ESP_ERR_INVALID_ARG;
#endif
}

void feedTaskWatchdog() {
  if (taskWatchdogReady) {
    esp_task_wdt_reset();
  }
}

}  // namespace

void setup() {
  // Set safety inputs before any attempt to arm outputs.
  pinMode(cfg::ESTOP_LOOP_PIN, INPUT);
  pinMode(cfg::PI_HARD_STOP_PIN, INPUT);
  pinMode(cfg::MODE_SELECT_PIN, INPUT);
  pinMode(cfg::LOCAL_RESET_PIN, INPUT_PULLUP);

  pwmReady = configurePwmAndPins();
  hardDisableMotors();

  Serial.begin(cfg::SERIAL_BAUD);
  delay(100);

  currentMode = readControlMode();
  if (!pwmReady) {
    setFault(FAULT_PWM_INIT);
  }
#if !MIIT_ENABLE_MOTOR_OUTPUTS
  setFault(FAULT_OUTPUTS_DISABLED);
#endif
  if (!estopLoopHealthy()) {
    estopLatched = true;
    requireFreshLocalResetGesture();
    setFault(FAULT_ESTOP_INPUT);
  }
  if (piHardStopActive()) {
    estopLatched = true;
    requireFreshLocalResetGesture();
    setFault(FAULT_PI_HARD_STOP);
  }

  taskWatchdogReady = configureTaskWatchdog();
  if (!taskWatchdogReady) {
    setFault(FAULT_TASK_WATCHDOG);
  }

#if MIIT_ENABLE_BLUETOOTH_MANUAL
  SerialBT.begin(cfg::BLUETOOTH_NAME);
#endif

  lastControlMs = millis();
  lastStatusMs = millis();
  sendState("BOOT");
}

void loop() {
  const uint32_t now = millis();

  serviceSafetyInputs(now);
  servicePiSerial();
#if MIIT_ENABLE_BLUETOOTH_MANUAL
  serviceBluetoothManual(now);
#endif
  serviceCommandWatchdogs(now);
  serviceMotorControl(now);

  if (static_cast<uint32_t>(now - lastStatusMs) >= cfg::STATUS_PERIOD_MS) {
    lastStatusMs = now;
    sendState();
  }

  feedTaskWatchdog();
  delay(2);
}
